[
    {
        "nome": "Pensamento Lógico Computacional Iniciante",
        "conteudo": "Objetivo\n\nIntroduzir os conceitos básicos de lógica computacional e raciocínio algorítmico.\n\nMódulo 1: Introdução à Lógica Computacional\n\nA lógica computacional é a base do raciocínio sistemático aplicado à resolução de problemas por meio da programação. Neste módulo, abordaremos como estruturar ideias de forma lógica, criando sequências coerentes de passos para alcançar resultados. Por exemplo, ao calcular o troco em uma compra, organizamos as operações para garantir que a soma dos valores pagos e o valor devido estejam corretos.\n\nMódulo 2: Estruturas Lógicas Básicas\n\nAs estruturas lógicas permitem que programas tomem decisões com base em condições. Imagine um aplicativo que verifica se um usuário é maior de idade para liberar conteúdo restrito. Usando operações como AND, OR e NOT, podemos criar fluxos de decisão que garantem respostas adequadas a diferentes cenários. Este módulo explora como combinar essas operações para resolver problemas cotidianos.\n\nMódulo 3: Introdução à Programação\n\nProgramar é transformar uma sequência lógica de raciocínios em código executável. Utilizando variáveis para armazenar dados e estruturas condicionais para tomar decisões, podemos criar programas básicos que realizam cálculos ou interagem com o usuário. Por exemplo, um aplicativo que calcula a média de notas precisa coletar os valores, somá-los e dividir pela quantidade de elementos.\n",
        "nivel": "iniciante"
    },
    {
        "nome": "Pensamento Lógico Computacional Intermediário",
        "conteudo": "Objetivo\n\nAprofundar os conceitos de lógica computacional e introduzir algoritmos mais complexos.\n\nMódulo 4: Estruturas de Repetição\n\nAs estruturas de repetição permitem executar uma sequência de ações várias vezes, como quando um contador exibe números de 1 a 100. Utilizando laços como FOR e WHILE, podemos criar programas que realizam operações repetitivas com eficiência, como calcular a soma dos primeiros 50 números naturais ou iterar sobre uma lista de compras para calcular o total.\n\nMódulo 5: Estruturas de Dados\n\nEstruturas como listas, tuplas e dicionários organizam dados de forma eficiente. Imagine um sistema de cadastro de alunos, onde cada estudante tem nome, idade e notas armazenadas. Utilizando essas estruturas, podemos acessar e manipular os dados de maneira clara e organizada, garantindo um processamento preciso das informações.\n\nMódulo 6: Funções e Modularidade\n\nFunções são blocos de código que executam tarefas específicas, como calcular a área de um círculo. A modularidade facilita a organização de programas complexos ao dividir grandes problemas em parte  menores e independentes. Por exemplo, um sistema bancário pode ter funções separadas para saque, depósito e consulta de saldo, garantindo um código mais limpo e fácil de manter.\n",
        "nivel": "intermediário"
    },
    {
        "nome": "Pensamento Lógico Computacional Avançado",
        "conteudo": "Objetivo\n\nDesenvolver habilidades de raciocínio lógico aplicadas a problemas complexos e otimização de algoritmos.\n\nMódulo 7: Algoritmos de Busca e Ordenação\n\nAlgoritmos de ordenação organizam dados de forma que possam ser encontrados rapidamente, como uma lista telefônica em ordem alfabética. Técnicas como Bubble Sort e Quick Sort ajudam a ordenar grandes volumes de dados. Já os algoritmos de busca, como a busca binária, permitem localizar um elemento específico de maneira eficiente, como procurar um livro pelo título em uma biblioteca digital.\n\nMódulo 8: Lógica de Programação Avançada\n\nA recursão é uma técnica poderosa onde uma função chama a si mesma para resolver problemas complexos, como dividir um problema em partes menores. Um exemplo clássico é a Torre de Hanói, onde discos precisam ser movidos entre pinos seguindo regras específicas. O uso de grafos e árvores para representar conexões entre elementos também será abordado, como em redes sociais que mostram conexões entre usuários.\n\nMódulo 9: Otimização e Análise de Algoritmos\n\nNem todos os algoritmos têm o mesmo desempenho; alguns podem ser extremamente rápidos, enquanto outros são lentos e ineficientes. Por exemplo, comparar um algoritmo que ordena 10 mil números em segundos com outro que leva minutos. Este módulo explora como analisar a eficiência e como otimizar algoritmos para tornar o processamento mais ágil e econômico.\n",
        "nivel": "avançado"
    },
    {
        "nome": "Infraestrutura Computacional Iniciante",
        "conteudo": "Objetivo\n\nApresentar os fundamentos da infraestrutura computacional, incluindo hardware, redes e sistemas operacionais.\n\nMódulo 1: Fundamentos de Hardware\n\nNeste módulo, abordaremos os componentes físicos de um computador, como CPU, memória RAM, discos rígidos e placas-mãe. Vamos explorar como cada peça contribui para o funcionamento da máquina. Por exemplo, a CPU executa instruções enquanto a RAM armazena dados temporariamente para acesso rápido. O objetivo é compreender como os componentes se interligam para formar um sistema funcional.\n\nMódulo 2: Sistemas Operacionais\n\nO sistema operacional (SO) é o software que gerencia os recursos de hardware e fornece uma interface para o usuário. Veremos exemplos práticos como Windows, Linux e macOS, destacando suas diferenças e funções principais. Vamos aprender como o SO controla processos, memória e dispositivos conectados, garantindo a comunicação entre hardware e software.\n\nMódulo 3: Introdução às Redes de Computadores\n\nRedes permitem a comunicação entre dispositivos, como computadores e servidores. Vamos abordar conceitos básicos de conectividade, como protocolos de rede (TCP/IP) e tipos de conexões (cabeada e sem fio). Por exemplo, ao acessar um site, o navegador envia uma solicitação que atravessa várias camadas de rede até alcançar o servidor.\n",
        "nivel": "iniciante"
    },
    {
        "nome": "Infraestrutura Computacional Intermediário",
        "conteudo": "Objetivo\n\nExplorar componentes mais complexos da infraestrutura computacional, incluindo servidores, redes corporativas e virtualização.\n\nMódulo 4: Servidores e Armazenamento\n\nOs servidores centralizam recursos e oferecem serviços para uma rede, como hospedagem de sites e armazenamento de arquivos. Vamos estudar configurações básicas, como RAID para redundância de dados, e tipos de servidores (Web, DNS, FTP). Um exemplo é um servidor de arquivos que permite o acesso compartilhado a documentos empresariais.\n\nMódulo 5: Redes Corporativas e Topologias\n\nNeste módulo, vamos explorar a organização física e lógica de redes empresariais. As topologias mais comuns incluem estrela, barramento e malha. Vamos analisar como escolher a topologia adequada para cada cenário. Um exemplo é uma rede em estrela, onde todos os dispositivos se conectam a um switch central para facilitar o gerenciamento.\n\nMódulo 6: Virtualização e Computação em Nuvem\n\nA virtualização permite executar vários sistemas operacionais em uma única máquina física. Vamos entender como hipervisores, como VMware e Hyper-V, gerenciam máquinas virtuais. Na computação em nuvem, recursos são fornecidos sob demanda via internet. Um exemplo prático é a criação de uma máquina virtual para testar um novo sistema sem afetar o ambiente de produção.\n",
        "nivel": "intermediário"
    },
    {
        "nome": "Infraestrutura Computacional Avançado",
        "conteudo": "Objetivo\n\nDesenvolver habilidades avançadas de configuração, manutenção e gerenciamento de infraestrutura computacional complexa.\n\nMódulo 7: Segurança de Redes e Sistemas\n\nManter a infraestrutura segura contra ameaças é essencial. Vamos explorar práticas como firewall, VPN e políticas de acesso. Um exemplo prático é configurar um firewall para bloquear portas vulneráveis enquanto permite o tráfego legítimo. Vamos também analisar técnicas de detecção de intrusão para identificar ataques.\n\nMódulo 8: Monitoramento e Gestão de Recursos\n\nMonitorar o desempenho de servidores e redes garante a continuidade do serviço. Utilizando ferramentas como Nagios e Zabbix, podemos rastrear uso de CPU, memória e tráfego de rede. Um exemplo é configurar alertas para evitar o esgotamento de recursos em um servidor crítico, garantindo a rápida resposta a falhas.\n\nMódulo 9: Alta Disponibilidade e Balanceamento de Carga\n\nInfraestruturas robustas exigem redundância e distribuição de carga para evitar falhas. Vamos explorar clusters e balanceadores de carga, garantindo que serviços permaneçam acessíveis mesmo durante manutenção ou falhas. Por exemplo, um balanceador de carga distribui solicitações entre vários servidores para evitar sobrecarga.\n",
        "nivel": "avançado"
    },
    {
        "nome": "Cibersegurança Iniciante",
        "conteudo": "Objetivo\n\nApresentar os fundamentos da cibersegurança, abordando conceitos básicos e práticas de proteção digital.\n\nMódulo 1: Fundamentos de Cibersegurança\n\nA cibersegurança consiste em proteger sistemas e dados contra acessos não autorizados e ataques cibernéticos. Vamos explorar conceitos como confidencialidade, integridade e disponibilidade. Um exemplo comum é o uso de senhas fortes para proteger contas online, evitando acessos indevidos. Também discutiremos os tipos de ameaças mais comuns, como malware e phishing.\n\nMódulo 2: Práticas Básicas de Segurança Digital\n\nProteger-se online envolve cuidados com senhas, autenticação e navegação segura. Vamos aprender a criar senhas robustas e a usar autenticação multifator (MFA) para aumentar a segurança. Por exemplo, ao ativar o MFA, mesmo que alguém descubra sua senha, precisará de outro fator para acessar a conta. Vamos também explorar práticas de segurança em redes públicas.\n\nMódulo 3: Identificação de Ameaças Comuns\n\nAs ameaças digitais são diversas, desde vírus até ataques de engenharia social. Vamos entender como identificar golpes comuns, como e-mails de phishing que tentam enganar usuários para roubar dados. Um exemplo prático será analisar um e-mail suspeito para identificar sinais de fraude, como links falsos e remetentes desconhecidos.\n",
        "nivel": "iniciante"
    },
    {
        "nome": "Cibersegurança Intermediário",
        "conteudo": "Objetivo\n\nDesenvolver habilidades para identificar, mitigar e responder a ameaças digitais em ambientes corporativos.\n\nMódulo 4: Gestão de Acessos e Identidades\n\nControlar quem acessa sistemas é fundamental para manter a segurança. Vamos aprender a configurar permissões com base no princípio do menor privilégio, garantindo que usuários só acessem o necessário. Um exemplo prático é configurar políticas de acesso em servidores, limitando usuários administrativos.\n\nMódulo 5: Segurança de Redes\n\nProteger uma rede contra invasões exige planejamento e ferramentas adequadas. Vamos explorar técnicas como firewall, filtragem de pacotes e criptografia de dados em trânsito. Um exemplo prático será configurar uma VPN para garantir uma conexão segura entre colaboradores remotos e a rede interna da empresa.\n\nMódulo 6: Análise e Resposta a Incidentes\n\nIdentificar e responder rapidamente a incidentes é essencial para mitigar danos. Vamos aprender como realizar análises forenses em dispositivos comprometidos e coletar evidências de ataques. Um exemplo prático será analisar logs de acessos suspeitos para identificar padrões de ataque, como tentativas repetidas de login.\n",
        "nivel": "intermediário"
    },
    {
        "nome": "Cibersegurança Avançado",
        "conteudo": "Objetivo\n\nDesenvolver habilidades avançadas para proteção, detecção e mitigação de ataques cibernéticos complexos.\n\nMódulo 7: Testes de Intrusão e Auditoria\n\nTestes de intrusão identificam vulnerabilidades em sistemas e redes. Vamos explorar como realizar testes éticos usando ferramentas como Metasploit e Nmap. Um exemplo prático será identificar falhas em um servidor web e propor correções, garantindo que brechas sejam eliminadas antes que sejam exploradas.\n\nMódulo 8: Criptografia e Segurança da Informação\n\nA criptografia protege dados sensíveis contra acessos não autorizados. Vamos explorar algoritmos de criptografia simétrica e assimétrica, como AES e RSA. Um exemplo prático será a criação de certificados digitais para garantir a autenticidade e a integridade de transações online.\n\nMódulo 9: Monitoramento e Prevenção de Ameaças Avançadas\n\nMonitorar sistemas continuamente permite identificar atividades suspeitas e responder rapidamente. Vamos utilizar ferramentas como SIEM para coletar e correlacionar eventos. Um exemplo prático será configurar alertas para detectar padrões de comportamento anômalo, como acessos fora do horário normal de trabalho.\n",
        "nivel": "avançado"
    },
    {
        "nome": "Tecnologia da Informação Iniciante",
        "conteudo": "Objetivo\n\nApresentar os conceitos básicos de TI, incluindo hardware, software e gestão de informações.\n\nMódulo 1: Fundamentos de Tecnologia da Informação\n\nA TI abrange o uso de sistemas computacionais para armazenar, processar e transmitir informações. Vamos explorar conceitos como hardware, software e redes, que compõem a infraestrutura digital moderna. Por exemplo, em um escritório, computadores interconectados por uma rede local compartilham recursos, como impressoras e arquivos.\n\nMódulo 2: Sistemas Operacionais e Aplicativos\n\nOs sistemas operacionais são a base para executar aplicativos e gerenciar dispositivos. Vamos aprender sobre os principais SOs, como Windows, Linux e macOS, e entender como instalar e configurar programas essenciais. Um exemplo prático será instalar um pacote de escritório para editar documentos e planilhas.\n\nMódulo 3: Gestão de Arquivos e Armazenamento\n\nArmazenar e organizar informações de maneira eficiente é crucial no ambiente digital. Vamos aprender a utilizar sistemas de arquivos para criar, mover e arquivar documentos. Por exemplo, estruturar pastas para armazenar relatórios mensais evita a perda de dados e facilita o acesso rápido às informações.\n",
        "nivel": "iniciante"
    },
    {
        "nome": "Tecnologia da Informação Intermediário",
        "conteudo": "Objetivo\n\nDesenvolver habilidades de gestão de infraestrutura de TI e suporte técnico.\n\nMódulo 4: Redes e Conectividade\n\nAs redes são essenciais para compartilhar recursos e conectar dispositivos. Vamos aprender a configurar redes locais (LAN) e entender conceitos como IP, DNS e DHCP. Um exemplo prático será configurar um roteador para distribuir internet em um ambiente corporativo, garantindo conexões estáveis e seguras.\n\nMódulo 5: Banco de Dados e Armazenamento Corporativo\n\nOs bancos de dados permitem armazenar e gerenciar grandes volumes de informações. Vamos explorar sistemas como MySQL e PostgreSQL, aprendendo a criar e consultar tabelas. Por exemplo, um sistema de gestão escolar pode armazenar dados de alunos e professores em um banco de dados relacional.\n\nMódulo 6: Gestão de Serviços de TI (ITIL)\n\nA gestão eficiente dos serviços de TI garante que os recursos sejam utilizados de forma estratégica. Vamos explorar as melhores práticas do ITIL para suporte, manutenção e desenvolvimento de serviços tecnológicos. Um exemplo é a criação de um catálogo de serviços que lista as soluções oferecidas pelo departamento de TI.\n",
        "nivel": "intermediário"
    },
    {
        "nome": "Tecnologia da Informação Avançado",
        "conteudo": "Objetivo\n\nDesenvolver habilidades de administração avançada de sistemas e gestão de projetos de TI.\n\nMódulo 7: Administração de Servidores e Cloud Computing\n\nServidores locais e na nuvem armazenam dados e executam aplicações críticas. Vamos aprender a configurar servidores web, como Apache e Nginx, e explorar soluções em nuvem, como AWS e Azure. Um exemplo prático será criar uma instância de servidor para hospedar um site institucional.\n\nMódulo 8: Segurança e Governança de TI\n\nManter os sistemas seguros e em conformidade é fundamental. Vamos explorar políticas de segurança, análise de vulnerabilidades e conformidade com normas como LGPD e GDPR. Um exemplo prático será implementar uma política de backup para garantir a continuidade dos negócios em caso de falhas.\n\nMódulo 9: Gerenciamento de Projetos de TI\n\nA gestão de projetos garante que as soluções tecnológicas sejam entregues no prazo e dentro do orçamento. Vamos explorar metodologias ágeis, como Scrum e Kanban, e aprender a usar ferramentas como Trello e Jira. Um exemplo prático será planejar um projeto de migração de dados para a nuvem.\n",
        "nivel": "avançado"
    },
    {
        "nome": "Programação Básica Iniciante",
        "conteudo": "Objetivo\n\nEnsinar os conceitos fundamentais da programação, desde a lógica até a criação de programas simples.\n\nMódulo 1: Introdução à Programação\n\nProgramação é o processo de criar instruções para que um computador realize tarefas específicas. Vamos explorar conceitos básicos, como algoritmos e lógica sequencial. Por exemplo, para criar um programa que some dois números, precisamos coletar os valores, somá-los e exibir o resultado na tela. Esse processo será detalhado para compreensão dos passos.\n\nMódulo 2: Variáveis e Operadores\n\nAs variáveis armazenam dados que podem ser manipulados durante a execução de um programa. Vamos aprender a criar variáveis e usar operadores aritméticos, como soma (+), subtração (-), multiplicação (*) e divisão (/). Um exemplo prático será criar um programa que calcula a média de três notas fornecidas pelo usuário.\n\nMódulo 3: Estruturas Condicionais\n\nTomar decisões com base em condições é fundamental na programação. Vamos explorar estruturas como IF, ELSE e ELIF, usadas para controlar o fluxo de um programa. Por exemplo, um caixa eletrônico verifica se o saldo é suficiente antes de permitir um saque, garantindo que a transação só aconteça se houver dinheiro disponível.\n",
        "nivel": "iniciante"
    },
    {
        "nome": "Programação Básica Intermediário",
        "conteudo": "Objetivo\n\nDesenvolver habilidades de programação intermediária, com foco em estruturas de repetição e modularidade.\n\nMódulo 4: Estruturas de Repetição\n\nOs laços de repetição permitem executar uma sequência de comandos várias vezes. Vamos aprender a usar FOR e WHILE para iterar sobre coleções de dados ou executar tarefas repetitivas. Por exemplo, um programa que imprime os números de 1 a 10 utiliza um laço FOR para garantir a repetição controlada.\n\nMódulo 5: Listas e Coleções\n\nListas armazenam vários valores em uma única variável, facilitando a manipulação de grandes volumes de dados. Vamos aprender a criar, acessar e modificar listas. Um exemplo prático será criar uma lista com nomes de alunos e percorrê-la para exibir cada nome individualmente.\n\nMódulo 6: Funções e Modularidade\n\nFunções permitem criar blocos reutilizáveis de código, facilitando a organização e manutenção. Vamos aprender a definir e chamar funções, passando argumentos e recebendo retornos. Por exemplo, uma função que calcula a área de um círculo a partir do raio torna o código mais limpo e modular.\n",
        "nivel": "intermediário"
    },
    {
        "nome": "Programação Básica Avançado",
        "conteudo": "Objetivo\n\nAprimorar habilidades de programação com foco em algoritmos e estruturas de dados avançadas.\n\nMódulo 7: Algoritmos de Ordenação\n\nOrdenar dados é uma tarefa comum na programação. Vamos explorar algoritmos como Bubble Sort, Selection Sort e Quick Sort. Um exemplo prático será ordenar uma lista de números inseridos pelo usuário e exibir o resultado na tela, comparando a eficiência de cada método.\n\nMódulo 8: Manipulação de Arquivos\n\nOs programas frequentemente precisam ler e escrever dados em arquivos. Vamos aprender a abrir, editar e salvar arquivos de texto, garantindo que as informações sejam persistidas além da execução do programa. Um exemplo prático será criar um registro simples de vendas que armazena o histórico em um arquivo.\n\nMódulo 9: Programação Orientada a Objetos (POO)\n\nA POO organiza o código em objetos que combinam dados e funcionalidades. Vamos explorar conceitos como classes, métodos e herança. Por exemplo, em um jogo de RPG, podemos criar uma classe para representar personagens, com atributos como força e agilidade, e métodos que realizam ataques.\n",
        "nivel": "avançado"
    },
    {
        "nome": "Segurança Digital e LGPD Iniciante",
        "conteudo": "Objetivo\n\nApresentar os conceitos básicos de segurança digital, proteção de dados pessoais e princípios éticos no uso da informação.\n\nMódulo 1: Fundamentos da Segurança Digital\n\nSegurança digital é o conjunto de práticas que protegem informações contra acessos não autorizados. Vamos explorar conceitos básicos, como senhas fortes, autenticação multifator (MFA) e cuidados com links suspeitos. Um exemplo prático será criar senhas complexas e ativar MFA em contas pessoais, garantindo proteção adicional contra invasões.\n\nMódulo 2: Noções Básicas da LGPD\n\nA Lei Geral de Proteção de Dados (LGPD) garante a privacidade dos dados pessoais no Brasil. Vamos entender os princípios da coleta, armazenamento e uso de dados. Por exemplo, empresas só podem coletar informações essenciais para a finalidade informada, como dados de contato para envio de boletins informativos.\n\nMódulo 3: Ética no Uso da Informação\n\nUtilizar dados de forma ética significa respeitar a privacidade e obter consentimento explícito. Vamos discutir casos de uso ético e antiético de informações pessoais. Um exemplo prático será analisar o impacto negativo do compartilhamento indevido de dados de clientes em redes sociais.\n",
        "nivel": "iniciante"
    },
    {
        "nome": "Segurança Digital e LGPD Intermediário",
        "conteudo": "Objetivo\n\nDesenvolver habilidades práticas de gestão segura de informações e cumprimento da LGPD em ambientes corporativos.\n\nMódulo 4: Política de Segurança da Informação\n\nCriar e implementar políticas internas que garantam a proteção dos dados é essencial para evitar vazamentos. Vamos aprender a definir regras claras para o uso de dispositivos, armazenamento de dados e acessos. Um exemplo será criar uma política de senhas que exija complexidade e troca periódica.\n\nMódulo 5: Proteção de Dados Pessoais no Ambiente de Trabalho\n\nNo ambiente corporativo, proteger dados de clientes e colaboradores é uma obrigação legal. Vamos explorar práticas como pseudonimização e controle de acesso. Um exemplo prático será configurar um sistema de CRM para restringir o acesso apenas a funcionários autorizados.\n\nMódulo 6: Monitoramento e Controle de Acessos\n\nMonitorar acessos aos sistemas garante a detecção de comportamentos suspeitos. Vamos utilizar ferramentas de registro e auditoria para rastrear acessos indevidos. Um exemplo será configurar alertas para tentativas de login fora do horário comercial, indicando possíveis invasões.\n",
        "nivel": "intermediário"
    },
    {
        "nome": "Segurança Digital e LGPD Avançado",
        "conteudo": "Objetivo\n\nCapacitar profissionais a desenvolver estratégias robustas de proteção de dados e responder a incidentes de segurança.\n\nMódulo 7: Implementação de Programas de Conformidade\n\nPara garantir o cumprimento da LGPD, as empresas precisam implementar programas de conformidade e governança de dados. Vamos explorar como mapear fluxos de dados, realizar avaliações de impacto (DPIA) e criar planos de mitigação. Um exemplo será mapear o ciclo de vida dos dados coletados em um e-commerce, garantindo que o armazenamento e o descarte sigam as normas.\n\nMódulo 8: Gestão de Incidentes e Violação de Dados\n\nQuando um incidente ocorre, a resposta rápida minimiza os danos. Vamos aprender a criar planos de resposta a incidentes e comunicar vazamentos conforme exigido pela LGPD. Um exemplo prático será simular um ataque de ransomware e aplicar um plano de contenção e notificação.\n\nMódulo 9: Auditorias e Relatórios de Conformidade\n\nAuditar os processos garante a identificação de falhas na proteção de dados. Vamos aprender a realizar auditorias periódicas e elaborar relatórios para autoridades reguladoras. Um exemplo será criar um relatório de conformidade que demonstre as práticas adotadas para garantir a proteção dos dados pessoais.\n",
        "nivel": "avançado"
    }
]